# LoadForceFx Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..LoadForceFx Property
ParameterTypeId Class See Also
---
"Fx"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId LoadForceFx { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property LoadForceFx As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ LoadForceFx {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace